# PointLightShape Class

---
This class encapsulates a point light shape.
SystemObject Autodesk.Revit.DB.LightingLightShape Autodesk.Revit.DB.LightingPointLightShape
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class PointLightShape : LightShape

    Public Class PointLightShape
    	Inherits LightShape

    public ref class PointLightShape : public LightShape

    type PointLightShape =
        class
            inherit LightShape
        end
The PointLightShape type exposes the following members.
| Name| Description
---|---|---
| PointLightShape|  Creates a point light shape object.
| PointLightShape(PointLightShape)|  Creates a copy of the given point light shape
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from LightShape)
Top
| Name| Description
---|---|---
| Clone|  Creates a copy of the LightShape derived object. (Inherited from LightShape)
| Dispose| (Inherited from LightShape)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Lighting Namespace